@echo off
@rem 起動前にanaconda gitをインストール

echo ---------------------------------------------------------------------------
echo whisper 環境作成
echo ---------------------------------------------------------------------------
@rem whisperを作成
echo Y | call conda create -n whisper
echo ---------------------------------------------------------------------------

echo whisper 環境起動
echo ---------------------------------------------------------------------------
@rem anaconda/miniconda wisper起動
echo Y | call conda activate whisper
echo ---------------------------------------------------------------------------

echo 色々とインストール
echo ---------------------------------------------------------------------------
@rem 色々インストール
echo Y | call conda install pytorch torchvision torchaudio cudatoolkit=11.6 -c pytorch -c conda-forge
echo ---------------------------------------------------------------------------

echo ffmpegインストール
echo ---------------------------------------------------------------------------
@rem ffmpegをインストール
echo Y | call conda install ffmpeg -c conda-forge
echo ---------------------------------------------------------------------------

echo githubからwhisperダウンロード
echo ---------------------------------------------------------------------------
@rem whisperをダウンロード・インストール
echo Y | call pip install git+https://github.com/openai/whisper.git
echo ---------------------------------------------------------------------------

echo インストール完了！バッチファイルに変換したいファイルをドロップして下さい！
echo ---------------------------------------------------------------------------

pause
exit

@rem 10/21 v1.00
@rem 参考サイト
@rem https://tadaoyamaoka.hatenablog.com/entry/2022/09/23/140401